{
    "https://www.freelancer.com/projects/android-app-development/Automatic-Instagram-Posting-using-Python": "                Hi there!\n                \n            I can help you complete your  project stated as follows \n            Project Description:\nI am looking for a freelancer to develop an automatic Instagram content posting script using Python and ADB. It has a Python ADB automation script developed as open source. Debugging tools using ADB are, as far as I know, appium and uiautomator. It was developed with uiautomator. Also, this script was single-threaded. However, a month ago, the function was extended to operate in multi-thread through a freelance developer.\n\nThis script is optimized for Instagram version:\n226.1.0.16.117\n\nThe script should be able to:\n- Connect to multiple devices via USB and post content to Instagram on each device simultaneously.\n- Control settings related to automatic posting through a .yml configuration file, such as the target account, content posting limit, and caption spintax.\n\nSkills Required:\n- Proficient in Python\n- Experience with ADB\n\nBonus Points:\n- Ability to think creatively and come up with new features\n- Strong work ethic and attention to detail\n- A bonus will be awarded for innovative features or outstanding performance.\n\nProject Timeline:\n- The project should be completed within 2-3 weeks.\n\nPayment Terms:\n- Prepayment: 20%\n- Interim payment: 30%\n- On completion: 50%\n(can be changed)\n\nIf you are interested in this project, please send me a message with your resume and portfolio. I look forward to hearing from you!\n- The script should be able to post a variety of content, including photos, videos, and carousels.\n- The script should be able to generate captions automatically, either by using spintax or by scraping captions from other Instagram posts.\n- The script should be well-documented and easy to maintain.\n\nThe basic guidelines are as above. But I'm not a developer so my imagination to implement features is limited. Correct and supplement the lacking part entirely by your insight. I'd be happy to give you a bonus if you show a very good idea or great performance.\n\nI hope this helps!\n\n            \n                Kind regards,\n                Isaac                 ",
    "https://www.freelancer.com/projects/php/Dev-for-Professional-SAAS-Project": "                Hi there!\n                \n            I can help you complete your  project stated as follows \n            Main goal for this project is to provide companies the tool they need to use WhatsApp as a collaborative way to communicate with their customers without need to go with WhatsApp pro API.\n\nThe administrator needs to be able to add or delete agents\nThe administrator needs to be able to add or delete phone numbers and will be able to scan QR codes if the WhatsApp solution needs it.\nThe only setting needed at the moment for the administrator is to choose if all agents can see all conversations or if agents can see only their own conversations.\nAdmin should also choose if the incoming conversation with no agents assigned should be assigned in a round-robin or if manually assigned.\nThe administrator can create e quick answer that could be used into chats\n\nWe will provide frontend design for Chat and other pages.\nAgents should be able to receive an invitation when the admin add them and then access the chat interface.\n\nOthers functionalities:\nAll contacts should be matched with one phone number\nAdd a subscription model with management the in Backend for the owner of SaaS (possibility to suspend customer, and change pricing)\nSign Up and login in for admins and agents should be possible via email or google account\nAn agent can add tags to a conversation (and therefore create them)\nWe need an endpoint to send messages by API from other sources.\nWe need when a message is sent from the interface, it will be resent as a webhook\n\nFor now, we want a functioning model and we will grow functionalities in the future\nCode should be well documented and structure created to anticipate the next evolutions.\n\nThe preferred language for the backend is Django but we are open to other stacks\nFor now, the interface would be only web but if we can use PWA apps, it would be a huge plus\n\n            \n                Kind regards,\n                Isaac                 "
}